namespace XCCChatRoom.ViewPage;

public partial class UserPrivacyListPage : ContentPage
{
	public UserPrivacyListPage()
	{
        InitializeComponent();
		textLabel.Text =
			"""
			感谢您使用我们的软件！我们非常重视您的隐私，并致力于保护您的个人信息。为了让您更好地了解我们收集、使用和共享您的个人信息的方式，我们制定了本隐私政策。请在使用我们的服务之前详细阅读以下内容。

			1. 收集的信息

			我们可能收集以下信息：

			个人信息：当您注册账户或使用我们的服务时，我们可能会收集您的姓名、电子邮件地址、电话号码等个人身份信息。

			设备信息：我们可能会收集与您使用的设备相关的信息，包括设备型号、操作系统版本、唯一设备标识符等。

			日志信息：当您使用我们的服务时，我们可能会自动收集与您的使用方式相关的信息，包括但不限于您的IP地址、访问时间、浏览器类型和语言、点击流和参考网址等数据。

			2. 信息的使用

			我们可能使用收集到的信息来：

			向您提供我们的服务；

			处理您的交易请求；

			向您发送与我们服务相关的通知；

			分析和改进我们的服务；

			防止欺诈和滥用。

			3. 信息的分享

			我们不会向第三方出售、交易或转让您的个人信息。但以下情况除外：

			与合作伙伴的分享：为了向您提供更好的服务，我们可能会与信任的合作伙伴共享必要的信息。

			符合法律法规要求：我们可能根据法律、法规、法院命令或政府机关的要求，分享您的个人信息。

			4. 信息的保护

			我们采取了必要的安全措施，保护您的个人信息不被丢失、滥用或篡改。但请注意，互联网并不是绝对安全的环境，因此我们不能确保您的信息在所有情况下都会百分之百安全。

			5. Cookie和类似技术

			我们可能使用Cookie和类似的技术来提供、保护和改善我们的服务。您可以通过浏览器设置拒绝Cookie的使用。

			6. 隐私政策的变更

			我们可能会不时更新本隐私政策。在更新隐私政策时，我们会在网站上发布通知，以便您了解我们如何保护您的个人信息。

			如果您对本隐私政策或您的个人信息有任何疑问，请联系我们：[你的联系方式]。

			感谢您阅读我们的隐私政策！
			""";
	}
}